"use strict";

const DEBUG = true
if (DEBUG !== true) { console.log = ()=>{} }

ymaps.ready(['AnimatedLine']).then(init);

function init(ymaps) {
  console.log('---log---  init')
  // Создаем карту.
  var myMap = new ymaps.Map("map", {
    center: [45.345374032, 40.138917891],
    type: 'yandex#satellite',
    zoom: 25,  // max=19
    controls: [] // карта без элементов управления
  }, {
    searchControlProvider: 'yandex#search'
  });

  // Создаем ломаные линии.
  var firstAnimatedLine = new ymaps.AnimatedLine([
    [45.345374032, 40.138917891, '2019-11-02 06:44:08.000000'],
    [45.345373894, 40.138917596, '2019-11-02 06:44:08.400000'],
    [45.345373764, 40.138917889, '2019-11-02 06:44:08.600000'],
    [45.345374022, 40.138917860, '2019-11-02 06:44:08.800000'],
    [45.345373433, 40.138917791, '2019-11-02 06:44:09.000000'],
    [45.345373717, 40.138918135, '2019-11-02 06:44:09.200000'],
    [45.345372592, 40.138918415, '2019-11-02 06:44:09.400000'],
    [45.345372264, 40.138918689, '2019-11-02 06:44:09.600000'],
    [45.345372361, 40.138919232, '2019-11-02 06:44:09.800000'],
    [45.345372189, 40.138920146, '2019-11-02 06:44:10.000000'],
    [45.345372278, 40.138920140, '2019-11-02 06:44:10.200000'],
    [45.345371014, 40.138922206, '2019-11-02 06:44:10.400000'],
    [45.345370904, 40.138922661, '2019-11-02 06:44:10.600000'],
    [45.345371277, 40.138921657, '2019-11-02 06:44:10.800000'],
    [45.345370868, 40.138923013, '2019-11-02 06:44:11.000000'],
    [45.345370596, 40.138924063, '2019-11-02 06:44:11.200000'],
    [45.345370781, 40.138924755, '2019-11-02 06:44:11.400000'],
    [45.345370695, 40.138926046, '2019-11-02 06:44:11.600000'],
    [45.345370980, 40.138925381, '2019-11-02 06:44:11.800000'],
    [45.345371020, 40.138925852, '2019-11-02 06:44:12.000000'],
    [45.345371519, 40.138925774, '2019-11-02 06:44:12.200000'],
    [45.345371329, 40.138925574, '2019-11-02 06:44:12.400000'],
    [45.345371139, 40.138924345, '2019-11-02 06:44:12.600000'],
    [45.345370758, 40.138923245, '2019-11-02 06:44:12.800000'],
    [45.345370144, 40.138923065, '2019-11-02 06:44:13.000000'],
    [45.345369985, 40.138923591, '2019-11-02 06:44:13.200000'],
    [45.345370015, 40.138923343, '2019-11-02 06:44:13.400000'],
    [45.345370924, 40.138922406, '2019-11-02 06:44:13.600000'],
    [45.345370357, 40.138921587, '2019-11-02 06:44:13.800000']
  ], {}, {
    // Задаем цвет.
    strokeColor: "#ED4543",
    // Задаем ширину линии.
    strokeWidth: 5,
    // Задаем длительность анимации.
    // animationTime: 5000
  });

  // var secondAnimatedLine = new ymaps.AnimatedLine([
  //     [55.761223661714205, 37.57854299428123],
  //     [55.76129474190374, 37.57836060406823],
  //     [55.76149285834102, 37.57855640532632],
  //     [55.76173267134118, 37.57864573959325],
  //     [55.761782872763874, 37.578559582240004],
  //     [55.7622647306412, 37.57857741008619],
  //     [55.76247342821094, 37.57840038429122],
  //     [55.762818964832924, 37.57765342764373],
  //     [55.76292179998886, 37.57748713068481],
  //     [55.762890042102114, 37.577167947812036],
  //     [55.76292179998886, 37.576878269238435],
  //     [55.763076052212064, 37.57669587902541],
  //     [55.76309672830313, 37.57723949881904]
  // ], {}, {
  //     strokeColor: "#1E98FF",
  //     strokeWidth: 5,
  //     animationTime: 4000
  // });

  // Добавляем линии на карту.
  myMap.geoObjects.add(firstAnimatedLine);
  // myMap.geoObjects.add(secondAnimatedLine);
  // Создаем метки.
  // var firstPoint = new ymaps.Placemark([55.7602953585417, 37.57705113964169], {}, {
  //     preset: 'islands#redRapidTransitCircleIcon'
  // });
  // var secondPoint = new ymaps.Placemark([55.76127880650197, 37.57839413202077], {}, {
  //     preset: 'islands#blueMoneyCircleIcon'
  // });
  // var thirdPoint = new ymaps.Placemark([55.763105418792314, 37.57724573612205], {}, {
  //     preset: 'islands#blackZooIcon'
  // });

  // Функция анимации пути.
  function playAnimation() {
    // Убираем вторую линию.
    // secondAnimatedLine.reset();
    // Добавляем первую метку на карту.
    // myMap.geoObjects.add(firstPoint);
    // Анимируем первую линию.
    firstAnimatedLine.animate()
      // После окончания анимации первой линии добавляем вторую метку на карту и анимируем вторую линию.
      // .then(function() {
      //     // myMap.geoObjects.add(secondPoint);
      //     return secondAnimatedLine.animate();
      // })
      // После окончания анимации второй линии добавляем третью метку на карту.
      .then(function() {
        // myMap.geoObjects.add(thirdPoint);
        // Добавляем паузу после анимации.
        return ymaps.vow.delay(null, 2000);
      })
      // После паузы перезапускаем анимацию.
      .then(function() {
        // Удаляем метки с карты.
        // myMap.geoObjects.remove(firstPoint);
        // myMap.geoObjects.remove(secondPoint);
        // myMap.geoObjects.remove(thirdPoint);
        // Убираем вторую линию.
        // secondAnimatedLine.reset();
        // Перезапускаем анимацию.
        // playAnimation();
      });
  }

  console.log('---log--- playAnimation()')
  // Запускаем анимацию пути.
  playAnimation();
}
